---
kind: property
id: P:Autodesk.Revit.DB.Opening.BoundaryRect
source: html/2ae871c2-8335-3ceb-a529-48a791e851c5.htm
---
# Autodesk.Revit.DB.Opening.BoundaryRect Property

Retrieves the geometry information if the opening boundary is a rect.

## Syntax (C#)
```csharp
public IList<XYZ> BoundaryRect { get; }
```

## Remarks
If IsRectBoundary is false, this value is Nothing nullptr a null reference ( Nothing in Visual Basic) .